package absoft;
/*
Написать программу которая будет выводить цифры от 1 до 5 используя цикл for
 */

public class test6_for {
    public static void main(String[] args) {
        int num;
        for (num = 1; num <= 5; num++){
            System.out.println(num);
        }
    }

}
